# Leader Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
Leader Class
Members See Also
---
A leader object that can be attached to annotation elements such as text notes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class Leader : APIObject
```

Visual Basic
---
```text
Public Class Leader _
	Inherits APIObject
```

Visual C++
---
```text
public ref class Leader : public APIObject
```

# Remarks
For information on how to attach or get leaders to/from a text annotation refer to corresponding methods of TextNote class.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..Leader
# See Also
Leader Members
Autodesk.Revit.DB Namespace